The-Nicolini/M365-JBD-BATTERY-BRIDGE-ESP32/src/main.cpp
// Forward declaration
static uint16_t jbdCrc(const uint8_t* data, uint8_t len);

// ─── JBD write helper ───────────────────────────────────────────────────────
// Write format: DD 5A <reg> <len> <data...> <crc_hi> <crc_lo> 77
// CRC covers [reg, len, data...]
static void sendJbdWrite(uint8_t reg, const uint8_t* data, uint8_t len) {
    // Unlock with default password 0x0000
    // CRC of [0x00, 0x02, 0x00, 0x00] = 0xFFFE
    static const uint8_t unlock[] = {0xDD, 0x5A, 0x00, 0x02, 0x00, 0x00, 0xFF, 0xFE, 0x77};
    while (jbdSerial.available()) jbdSerial.read();  // flush
    jbdSerial.write(unlock, sizeof(unlock));
    delay(60);
    while (jbdSerial.available()) jbdSerial.read();  // flush response

    // Build write packet
    uint8_t buf[32];
    buf[0] = 0xDD;
    buf[1] = 0x5A;
    buf[2] = reg;
    buf[3] = len;
    if (len > 0) memcpy(&buf[4], data, len);

    // CRC covers [reg, len, data...]
    uint8_t crcIn[32];
    crcIn[0] = reg;
    crcIn[1] = len;
    if (len > 0) memcpy(&crcIn[2], data, len);
    uint16_t crc = jbdCrc(crcIn, 2 + len);
    buf[4 + len] = (crc >> 8) & 0xFF;
    buf[5 + len] =  crc       & 0xFF;
    buf[6 + len] = 0x77;
    jbdSerial.write(buf, 7 + len);
    delay(60);
    while (jbdSerial.available()) jbdSerial.read();  // flush response
}

// ─── POST /bt — toggle JBD BMS Bluetooth ─────────────────────────────────────
// !! Register 0xE1 is commonly cited for JBD BT control but is firmware-dependent.
// !! Verify with a logic analyser or JBD PC software for your specific BMS.
void handleBtToggle() {
    btEnabled = !btEnabled;
    uint8_t val = btEnabled ? 0x01 : 0x00;
    sendJbdWrite(btReg, &val, 1);  // 0x01 = BT on, 0x00 = BT off
    Serial.printf("[BT] BMS Bluetooth %s\n", btEnabled ? "ON" : "OFF");
    webServer.sendHeader("Cache-Control", "no-cache");
    webServer.send(200, "application/json",
        String("{\"bt\":") + (btEnabled ? "true" : "false") + "}");
}


// ─── POST /kill — toggle ESC kill ───────────────────────────────────────────────────
static void buildSettingsJson(String& j) {
    j += "\"bt_enabled\":"    + String(btEnabled    ? "true" : "false") + ",";
    j += "\"bt_reg\":"        + String(btReg)                           + ",";
    j += "\"esc_kill\":"      + String(escKill      ? "true" : "false") + ",";
    j += "\"soc_spoof\":"     + String(socSpoof     ? "true" : "false") + ",";
    j += "\"soc_spoof_val\":" + String(socSpoofVal)                     + ",";
    j += "\"poll_ms\":"       + String(jbdPollMs)        + ",";
    j += "\"pack_cells\":"    + String(packCells)  + ",";
    j += "\"wifi_ssid\":\""        + String(apSsid)                              + "\",";
}

void handleKillToggle() {
    escKill = !escKill;
    Serial.printf("[Kill] ESC Kill %s\n", escKill ? "ON" : "OFF");
    String j = "{";
    buildSettingsJson(j);
    j += "}";
    webServer.sendHeader("Cache-Control", "no-cache");
    webServer.send(200, "application/json", j);
}

// ─── POST /settings — apply settings from modal ───────────────────────────────────
void handleSettings() {
    if (webServer.hasArg("bt")) {
        bool newBt = webServer.arg("bt") == "1";
        if (newBt != btEnabled) {
            btEnabled = newBt;
            uint8_t val = btEnabled ? 0x01 : 0x00;
            sendJbdWrite(btReg, &val, 1);
            Serial.printf("[Settings] BT %s\n", btEnabled ? "ON" : "OFF");
        }
    }
    if (webServer.hasArg("btReg")) {
        uint8_t r = (uint8_t)strtol(webServer.arg("btReg").c_str(), nullptr, 16);
        if (r != 0) btReg = r;
    }
    if (webServer.hasArg("escKill"))  escKill     = webServer.arg("escKill")  == "1";
    if (webServer.hasArg("socSpoof")) socSpoof    = webServer.arg("socSpoof") == "1";
    if (webServer.hasArg("socSpoofVal")) {
        int v = webServer.arg("socSpoofVal").toInt();
        socSpoofVal = (uint8_t)constrain(v, 0, 100);
    }
    if (webServer.hasArg("pollMs")) {
        int ms = webServer.arg("pollMs").toInt();
        if (ms >= 200 && ms <= 5000) jbdPollMs = (uint32_t)ms;
    }
    if (webServer.hasArg("packCells")) {
        int c = webServer.arg("packCells").toInt();
        if (c >= 1 && c <= 24) packCells = (uint8_t)c;
    }
    if (webServer.hasArg("apSsid")) {
        String s = webServer.arg("apSsid");
        s.trim();
        if (s.length() >= 1 && s.length() <= 32) {
            strlcpy(apSsid, s.c_str(), sizeof(apSsid));
#if defined(ESP32) || defined(ESP32S3) || defined(ESP32C3)
            prefs.putString("ssid", apSsid);
#endif
            apRestartPending = true;
        }
    }
    if (webServer.hasArg("apPass")) {
        String p = webServer.arg("apPass");
        if (p.length() >= 8 && p.length() <= 63) {
            strlcpy(apPass, p.c_str(), sizeof(apPass));
#if defined(ESP32) || defined(ESP32S3) || defined(ESP32C3)
            prefs.putString("pass", apPass);
#endif
            apRestartPending = true;
        }
    }
    Serial.printf("[Settings] kill=%d spoof=%d(%d%%) poll=%ums cells=%dS ssid=%s\n",
        escKill, socSpoof, socSpoofVal, jbdPollMs, packCells, apSsid);
    String j = "{";
    buildSettingsJson(j);
    j += "}";
    webServer.sendHeader("Cache-Control", "no-cache");
    webServer.send(200, "application/json", j);
}

// ─── /data — JSON battery snapshot ───────────────────────────────────────────
void handleData() {
    String j = "{";
    j += "\"valid\":"         + String(batt.valid ? "true" : "false") + ",";
    j += "\"voltage_mv\":"    + String(batt.voltage_mv)    + ",";
    j += "\"current_ma\":"    + String(batt.current_ma)    + ",";
    j += "\"soc_pct\":"       + String(batt.soc_pct)       + ",";
    j += "\"remaining_mah\":" + String(batt.remaining_mah) + ",";
    j += "\"nominal_mah\":"   + String(batt.nominal_mah)   + ",";
    j += "\"prot_status\":"   + String(batt.prot_status)   + ",";
    j += "\"ntc_count\":"     + String(batt.ntc_count)     + ",";
    j += "\"temps\":[";
    for (uint8_t i = 0; i < batt.ntc_count; i++) {
        if (i) j += ",";
        j += String(batt.temp_c10[i]);
    }
    j += "],\"cell_count\":";
    j += String(batt.cell_count);
    j += ",\"cells\":[";
    uint8_t n = (batt.cell_count > 20) ? 20 : batt.cell_count;
    for (uint8_t i = 0; i < n; i++) {
        if (i) j += ",";
        j += String(batt.cell_mv[i]);
    }
    j += "],";
    buildSettingsJson(j);
    j += "}";
    webServer.sendHeader("Cache-Control", "no-cache");
    webServer.send(200, "application/json", j);
}

// ─── / — HTML dashboard ───────────────────────────────────────────────────────
void handleRoot() {
    webServer.sendHeader("Cache-Control", "no-cache");
    webServer.send_P(200, "text/html", HTML_PAGE);
}

// ─── JBD helpers ─────────────────────────────────────────────────────────────

/**
 * Compute JBD checksum for an outgoing command.
 * Covers: [cmd, 0x00] (the two bytes after 0xA5 for a read command).
 * For commands with data payload the sum covers those bytes too.
 */
static uint16_t jbdCrc(const uint8_t* data, uint8_t len) {
    uint16_t sum = 0;
    for (uint8_t i = 0; i < len; i++) sum += data[i];
    return (0x10000 - sum) & 0xFFFF;
}

/**
 * Read JBD response into jbdRxBuf.
 * Returns true when end marker 0x77 is received within timeout.
 */
static bool readJbdResponse() {
    jbdRxLen = 0;
    uint32_t t0 = millis();
    while (millis() - t0 < JBD_TIMEOUT_MS) {
        while (jbdSerial.available() && jbdRxLen < sizeof(jbdRxBuf)) {
            jbdRxBuf[jbdRxLen++] = (uint8_t)jbdSerial.read();
            // End-of-packet marker
            if (jbdRxLen >= 7 && jbdRxBuf[jbdRxLen - 1] == 0x77) return true;
        }
    }
    return false;
}

/**
 * Parse JBD 0x03 basic-info response.
 * Packet layout (after 0xDD start byte):
 *   [0] 0xDD  [1] 0x03  [2] 0x00 (OK)  [3] dataLen
 *   [4..4+dataLen-1] data
 *   [4+dataLen] crc_hi  [4+dataLen+1] crc_lo  [4+dataLen+2] 0x77
 */
static bool parseJbdBasicInfo(const uint8_t* buf, uint8_t len) {
    if (len < 8)           return false;
    if (buf[0] != 0xDD)    return false;
    if (buf[1] != 0x03)    return false;
    if (buf[2] != 0x00)    return false;  // 0x80 = error response

